Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
     + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "aws-node-termination-handler"
    }

  # module.workers-v1.aws_cloudwatch_event_rule.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_asg" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_rule.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_scheduled" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_rule.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_spot" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_rule.nth_state[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_state" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_target.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_asg" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_target.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_scheduled" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_target.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_spot" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.workers-v1.aws_cloudwatch_event_target.nth_state[0] will be created
+ resource "aws_cloudwatch_event_target" "nth_state" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.workers-v1.aws_iam_instance_profile.worker will be created
+ resource "aws_iam_instance_profile" "worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + role        = "eks-demo-b-worker"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.workers-v1.aws_launch_template.worker_spot[0] will be created
+ resource "aws_launch_template" "worker_spot" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = "true"
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = "c6i.large"
      + key_name        = "bruce-seoul"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = (known after apply)
      + tags_all        = (known after apply)
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = "spot"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + ipv6_address_count          = 0
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
    }

Plan: 84 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_endpoint      = (known after apply)
+ cluster_name          = "eks-demo-b"
+ cluster_oidc_arn      = (known after apply)
+ cluster_oidc_url      = (known after apply)
+ cluster_role_name     = "eks-demo-b-cluster"
+ cluster_version       = "1.23"
+ cluster_vpc_config    = {
      + cluster_security_group_id = (known after apply)
      + endpoint_private_access   = true
      + endpoint_public_access    = true
      + public_access_cidrs       = (known after apply)
      + security_group_ids        = (known after apply)
      + subnet_ids                = [
          + "subnet-01baefaafd9a5d53b",
          + "subnet-0a7db5a0fef954bb8",
          + "subnet-0e480aadf4a64c2bf",
        ]
      + vpc_id                    = (known after apply)
    }
+ irsa                  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
+ worker_role_name      = "eks-demo-b-worker"
+ worker_security_group = [
      + (known after apply),
      + "sg-07c699460cd936bb8",
    ]

time="2022-09-07T09:43:40Z" level=info msg="Detected Terraform plan JSON file at /atlantis-data/repos/opspresso/terraform-env-demo/13/default/demo/9-eks-b/default.json"
time="2022-09-07T09:43:40Z" level=info msg="Starting: Extracting only cost-related params from terraform"
time="2022-09-07T09:43:40Z" level=info msg="Starting: Retrieving cloud prices to calculate costs"
time="2022-09-07T09:43:41Z" level=info msg="Output saved to /tmp/opspresso-terraform-env-demo-13/infracost-output.json"

Comment posted to GitHub

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d demo/9-eks-b`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.demo.nalbam.com/lock?id=opspresso%252Fterraform-env-demo%252Fdemo%252F9-eks-b%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d demo/9-eks-b`
</details>
Plan: 84 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
